# DS0104 Python

# Import Packages

In [1]:
import pandas as pd

# Import Datasets

In [2]:
P1 = pd.read_csv("/Users/julieraeboucher/Desktop/Hi/WozU /Datasets/DS104-L4/DS_1.csv")
P2 = pd.read_csv("/Users/julieraeboucher/Desktop/Hi/WozU /Datasets/DS104-L4/DS_2.csv")
P3 = pd.read_csv("/Users/julieraeboucher/Desktop/Hi/WozU /Datasets/DS104-L4/DS_3.csv")
P4 = pd.read_csv("/Users/julieraeboucher/Desktop/Hi/WozU /Datasets/DS104-L4/DS_4.csv")
P5 = pd.read_csv("/Users/julieraeboucher/Desktop/Hi/WozU /Datasets/DS104-L4/DS_5.csv")

# Part 1
### Here's a listing of the number of power boats registered in Florida (in the 1000's) for each year, 35 years worth of data. Tinker with the settings until you have created a histogram with 7 bars.

In [3]:
P1.head()

   Power Boats (in 1000's)
0                      436
1                      449
2                      470
3                      487
4                      502

# Part 2
### Use the following data to create a bar graph.

In [4]:
P2.head()

         Cars
0  Mitsubishi
1  Mitsubishi
2       Dodge
3  Mitsubishi
4       Dodge

# Part 3
### Use the following data to create a stacked bar chart using either Python or R.

In [5]:
P3.head()

          Car   Location
0        Ford  Northwest
1        Ford       East
2  Mitsubishi  Northwest
3      Datsun  Northwest
4  Mitsubishi  Southwest

# Part 4
### The following dataset contains data for estuarine crocodiles, recording their head length and body length. Visualize the data with a clearly labeled scatter plot.

In [6]:
P4.head()

            CommonName  HeadLength  BodyLength
0  Estuarine Crocodile          24         161
1  Estuarine Crocodile          24         179
2  Estuarine Crocodile          32         226
3  Estuarine Crocodile          35         259
4  Estuarine Crocodile          40         287

# Part 5
### Here's data tracking heart attacks treated at a hospital chain in a large US city. Use this data to create a line chart. Be sure to label the graph, and label both axes.

In [7]:
P5.head()

  Month Day  Year  Heart Attacks
0   May  1,  2003             12
1   May  2,  2003             12
2   May  3,  2003              6
3   May  4,  2003             16
4   May  5,  2003             13